reproducibilityPackages/openfoam/snappyHexMesh/Re2000AoA35/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version 2.0;
  format  ascii;
  class   volScalarField;
  object  p;
}

//****************************************************************************//

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0.0;

boundaryField
{
  snake
  {
    type zeroGradient;
  }

  inlet
  {
    type zeroGradient;
  }

  outlet
  {
    type advective;
  }

  bottom
  {
    type symmetryPlane;
  }

  top
  {
    type symmetryPlane;
  }

  front
  {
    type empty;
  }

  back
  {
    type empty;
  }

  defaultFaces
  {
    type empty;
  }
}

//****************************************************************************//